'''
# возвращает число элементов в списке

len()

#индекс последнего элемента

lst[len(lst)-1] or

lst[-1]

#типы данных деляться на 2 класса:
# неизменяемые: числа, булевые значения, строки
# изменяемые : списки 


#дублирует нуди 100 раз ( также можно и со строками)
A = [0] * 1000

#добавлять элемент в список 
# оператором + можно обьединять списки
digs = [1, 2, 3, 4, 5]
digs = digs + [5] or

digs += [6]


# проверять есть ли элемент в списке или нет - in 
3 in digs


max 
min
sum == # суммируетзначения списков

#фугкуичя sorted сортирует списки по умолчанию 

sorted ()

если по убыванию 
sorted (d, reverse = True)

#сравгивать списки (> < !=)

[1, 2, 3] == [1, 2, 3] 

'''
'''
print("Hello")

lst = [-1, 0, 5, 3, 2]
i = 0
while i < len(lst):
    lst[i] += 7.2
    i += 1

print(lst)

''' 
'''
lst = []

for i in range(3):
    my_list = input("Enter any value: ")
    lst += [my_list], [my_list]

print(lst)
'''
'''
lst1 = [[1, 2], [3, 4], [5, 6]]
lst2 = [[1, 0], [0, 1], [1 ,1]]

lst3 = [[]]

for i in range (3):
    for j in range (2): 
        sum = lst1[i][j] + lst2[i][j]
        lst3[i][j] = sum



print(lst3)
'''














  





 